---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMirrorInView
source: html/2810930e-5817-a6ba-b9f0-5043019c455d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMirrorInView Property

Must specify Work Plane to mirror in a 3d View.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMirrorInView { get; }
```